<a href="https://colab.research.google.com/github/hnmelo/MujeresDigitales/blob/main/Taller3HelennMelo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Taller semana 3

## Ejercicio 1:

Cargue los datos del archivo ```pokemon_data.csv``` a un dataframe, cree una columna que se llame interes asignándole el valor False, luego cambie el valor de esta columna solo para los pokemon que sean legendarios (Legendary = True) y que el Type 1 sea fuego.

In [1]:
import pandas as pd #Importamos pandas

In [3]:
pk = pd.read_csv('pokemon_data.csv')

In [4]:
pk['interes'] = False #Le indicamos a python que cree una nueva columna con el valor "False"

In [37]:
mask1 = pk['Type 1'] == 'Fire' #Creamos una máscara con los valores de la columna Type 1 que sean igual a 'Fire'
mask1.append(pk['Legendary'] == True) #Adicionamos los valores de la columna Legendary que sean verdaderos a la variable mask1.

0      False
1      False
2      False
3      False
4       True
       ...
795     True
796     True
797     True
798     True
799     True
Length: 1600, dtype: bool

In [22]:
pk.loc[mask1,'interes'] = True #Le indicamos a python que en las filas donde se cumpla lo anterior en la columna 'interes' cambie el valor a verdadero
pk.head(15)

     #                       Name Type 1  ... Generation  Legendary  interes
0    1                  Bulbasaur  Grass  ...          1      False    False
1    2                    Ivysaur  Grass  ...          1      False    False
2    3                   Venusaur  Grass  ...          1      False    False
3    3      VenusaurMega Venusaur  Grass  ...          1      False    False
4    4                 Charmander   Fire  ...          1       True     True
5    5                 Charmeleon   Fire  ...          1       True     True
6    6                  Charizard   Fire  ...          1       True     True
7    6  CharizardMega Charizard X   Fire  ...          1       True     True
8    6  CharizardMega Charizard Y   Fire  ...          1       True     True
9    7                   Squirtle  Water  ...          1      False    False
10   8                  Wartortle  Water  ...          1      False    False
11   9                  Blastoise  Water  ...          1      False    False
12   9    BlastoiseMega Blastoise  Water  ...          1      False    False
13  10                   Caterpie    Bug  ...          1      False    False
14  11                    Metapod    Bug  ...          1      False    False

[15 rows x 13 columns]

## Ejercicio 2

Con los datos de pokemones anteriores, escriba un código para sacar el promedio de la columna Attack agrupado por Type 1.

In [ ]:
# Se agrupan los tipo 1 = 'fire' y la columna attack
T1 = pk.groupby(mask1)['Attack']

In [ ]:
#Se saca la media (que es igual al promedio) de la variable
#El promedio que necesitamos es el de True, debido que es el que cumple la condición de mask1
T1.mean()

Type 1
False    78.600267
True     84.769231
Name: Attack, dtype: float64

## Ejercicio 3

Se le entregan los datos de movimientos de acciones en el archivo ```DUK.csv```, y se le pide que entregue el promedio de Open del 2015, es decir entre las fechas 2015-01-01 y 2015-12-31

In [23]:
dk = pd.read_csv('DUK.csv')

In [29]:
dk.head(2)

         Date       Open       High        Low      Close  Adj Close   Volume
0  2014-07-28  73.309998  74.480003  73.230003  74.389999  59.266285  3281100
1  2014-07-29  74.400002  74.480003  73.760002  73.980003  58.939648  2236300

In [35]:
mascara = (dk['Date'] >= '2015-01-01') & (dk['Date'] <= '2016-01-01') #Máscara para guardar el rango de fechas
Open2015 = dk.loc[mascara,'Open'] #se guarda el loc donde cumpla el rango fecha en la columna open

In [36]:
Open2015.mean() #Se halla la media (promedio) de la variable

74.8137697698413